export const FATranslations = {
  global: {
    states: {
      neutral: 'حالتی که در آن خنثی است',
      success: 'حالتی که نشان‌دهنده موفقیت است',
      info: 'حالتی که اطلاعاتی را نشان میدهد',
      warning: 'حالتی که هشداری را نشان میدهد',
      error: 'حالتی که یک ارور نشان میدهد',
    },
    triggers: {
      hover: 'هاور ماوس',
      click: 'کلیک ماوس',
      focus: 'فوکوس با ماوس یا کیبورد',
    },
    fetching: 'در حال دریافت اطلاعات...',
    increase: 'افزایش مقدار',
    decrease: 'کاهش مقدار',
  },

  globalErrors: {
    onCopyFailure: 'مشکلی در هنگام کپی کردن پیش آمد',
    onCopySuccess: 'با موفقیت کپی شد',
  },

  globalI18ns: {
    imageViewer: {
      zoomInTooltip: 'بزرگ‌نمایی',
      closeTooltip: 'بستن',
      printTooltip: 'پرینت عکس',
      deleteTooltip: 'حذف عکس',
      downloadTooltip: 'دانلود عکس',
      zoomOutTooltip: 'کوچک‌نمایی',
      deletePopConfirmTitle: 'حذف عکس',
      deletePopConfirmCancelButton: 'انصراف',
      deletePopConfirmSubmitButton: 'بله، حذف',
      deletePopConfirmDescription: 'از حذف عکس اطمینان دارید؟',
    },
  },

  dialog: {
    open: 'باز کردن دیالوگ',
    openSizeOf: {
      small: 'باز کردن دیالوگ کوچیک',
      normal: 'بازکردن دیالوگ نرمال',
      large: 'باز کردن دیالوگ بزرگ',
    },
    actions: {
      addCategory: 'افزودن دسته بندی',
      prevLevel: 'مرحله قبل',
      close: 'بستن',
      cancel: 'منصرف شدم',
    },
    title: 'عنوان نمونه برای کامپوننت دیالوگ',
  },

  button: {
    sizingTitle: 'سایزهای مختلف دکمه',
    disabledTitle: 'دکمه غیر فعال',
    sampleTitle: 'دکمه نمونه',
    loadingTitle: 'در حال دریافت اطلاعات...',
  },

  checkbox: {
    sizingTitle: 'سایزهای مختلف چک‌باکس',
    sampleTitle: 'چک‌باکس نمونه',
  },

  longPress: {
    title: 'منو زیاد نگه دار تا شماره را افزایش دهم',
    buttonTitle: 'منو زیاد نگه دار',
  },

  longTap: {
    title: 'به من ضربه بزن و یکم نگه دار تا شماره را افزایش دهم',
    buttonTitle: 'به من ضربه بزن و یکم نگه دار',
  },

  contextMenu: {
    buttonTitle: 'روی من کلیک‌راست کن',
    title: 'روی من کلیک‌راست کن',
    description: 'یا در موبایل ضربه بزن و نگه دار',
  },

  spin: {
    tip: 'یه متن بعنوان راهنما یا متن لودینگ یا هر چیز دیگه',
  },

  reactionRate: {
    dispatch: 'پاسخ ناموفق هنگام ارسال',
  },

  select: {
    label: 'لیبل سلکت',
    placeholder: 'آپشن(ها) را انتخاب کنید',
  },

  input: {
    label: 'لیبل اینپوت',
    placeholder: 'مقداری را وارد کنید',
  },

  textarea: {
    label: 'لیبل تکست‌اریا',
    placeholder: 'مقداری را وارد کنید',
  },

  text: {
    sampleText: 'مقداری متن تستی برای تست کردن کامپوننت تکست',
  },

  title: {
    sampleText: 'مقداری متن تستی برای تست کردن کامپوننت تایتل',
  },

  menu: {
    buttonTitle: 'روی من کلیک کن تا باز بشم',
    menu1: 'تنظیمات برنامه',
    menu2: 'زبان اپلیکیشن',
    menu3: 'یه متن بلندتر برای تست متن‌های بلندتر',
    menu4: 'خروج از برنامه',
    menu5: 'پروفایل',
  },

  switch: {
    sizingTitle: 'سایزهای مختلف سوئیچ',
    sampleTitle: 'سوئیچ نمونه',
  },

  radio: {
    sizingTitle: 'سایزهای مختلف رادیو باتن',
    sampleTitle: 'رادیو باتن نمونه',
  },

  popover: {
    title: 'عنوان پاپ‌اور',
    description: 'مقداری توضیحات تستی برای تست کامپوننت پاپ‌اور',
  },

  progress: {
    title1: 'عنوان استپ اول',
    title2: 'عنوان استپ دوم',
    title3: 'عنوان استپ سوم',
    title4: 'عنوان استپ چهارم',
  },

  toast: {
    message: 'عنوان نمونه جهت نمایش در تست',
  },

  notification: {
    title: 'عنوان نمونه',
    message: 'پیام نمونه جهت نمایش در نوتیفیکیشن',
    dismiss: 'کلیک کن برای بسته شدن',
  },

  popConfirm: {
    title: 'حذف این مورد',
    description: 'آیا از حذف این مورد اطمینان دارید؟',
    ok: 'بله، حذف',
    no: 'انصراف',
    onOk: 'آیتم با موفقیت حذف شد',
    onNo: 'انصراف دادی',
    button: 'حذف آیتم',
  },

  tooltip: {
    children: 'منو هاور کن',
    title: 'منو هاور کردی',
  },

  filterButton: {
    title1: 'پر بازدید ترین',
    title2: 'ارزان ترین',
    title3: 'گران ترین',
  },

  copyToClipboard: {
    buttonTitle: 'کپی کن',
    text: 'این متن به کلیپ‌بورد اضافه شد',
    error: 'کپی نشد',
    success: 'کپی شد',
    callback: 'شروع شد به کپی کردن',
  },

  timeShift: {
    undo: 'بازگشت به عقب',
    message: 'این موردو حذف کردی. اگه میخوای به عقب برگرد',
    onShift: 'با موفقیت به عقب برگشتید و آیتم حذف شده بازگردانده شد.',
    action1: 'اکشن 1',
    action2: 'اکشن 2',
    action3: 'اکشن 3',
  },

  badge: {
    text: 'مقداری متن تستی برای تست کردن کامپوننت بج',
  },

  imageViewer: {
    opener: 'عکس(ها) رو باز کن',
  },

  image: {
    reGenerate: 'دریافت عکس جدید',
  },

  mention: {
    placeholder: 'متنی بنویس یا افراد را @منشن کن',
  },

  alert: {
    title: 'عنوانی نمونه برای قرار دادن بعنوان تایتل کامپوننت الرت',
    description:
      'مقداری توضیحات نسبتا طولانی تر برای اینکه بعنوان توضیحات کامپوننت الرت قرار بگیرد و کاربران بتوانند ان را بخوانند و از ان استفاده کنند و مورد هشدار قرار بگیرند و از چیز مهمی که گفتن ان اهیمت دارد با خبر شوند.',
  },

  tour: {
    content:
      'این استپ شامل مقداری محتوای دلخواه است. پراپ کانتنت به شما فانکشن‌هایی را خواهد داد که می‌توانید از آن برای کنترل کردن تور استفاده کنید. در زیر این متن چند دکمه وجود دارد که می‌توانید این فانکشن‌ها رو تست کنید',
    next: 'استپ بعدی',
    prev: 'استپ قبلی',
    toStep3: 'برو به استپ 3',
    stopTour: 'پایان تور',
    switchMe: 'منو سوئیچ کن',
    currentStep: 'ایندکس استپ فعلی',
    ttl: {
      sample: 'عنوان نمونه',
      everyThingTogether: 'همه چیز با هم',
      topEnd: 'بالا-آخر',
      topCenter: 'بالا-وسط',
      topStart: 'بالا-اول',
      centerEnd: 'وسط-آخر',
      center: 'وسط',
      centerStart: 'وسط-اول',
      bottomEnd: 'پایین-آخر',
      bottomCenter: 'پایین-وسط',
      bottomStart: 'پایین-اول',
      emoji: 'با ایموجی',
      icon: 'با متریال آیکن',
      noneClosable: 'غیر قابل بستن',
      loading: 'حالت لودینگ',
      onReach: 'موقع رسیدن',
      onClose: 'موقع بستن',
      refPositionStart: 'رفرنس در بالا',
      refPositionCenter: 'رفرنس در وسط',
      refPositionEnd: 'رفرنس در آخر',
    },
    desc: {
      sample:
        'این مقداری توضیحات نمونه است. از این متون استفاده میکنیم که فقط مقدار بیشتری فضا اشغال کنیم. وگرنه محتوای ارزشمندی نیست',
      everyThingTogether:
        'در این استپ همه چیز رو با هم خواهیم داشت. مثلا تایتل و توضیحات و پالس و ایموجی و آیکن و لودینگ و در کل هر چیزی که میتونه یه استپ داشته باشه',
      topEnd: 'این استپ در بالای صفحه و در آخر صفحه قرار گرفته است',
      topCenter: 'این استپ در بالای صفحه و در وسط آن قرار گرفته است',
      topStart: 'این استپ در بالای صفحه و در شروع آن قرار گرفته است',
      centerEnd: 'این استپ در وسط صفحه و در آخر صفحه قرار گرفته است',
      center: 'این استپ بصورت افقی و عمودی در وسط صفحه قرار گرفته است',
      centerStart: 'این استپ در وسط صفحه و در شروع صفحه قرار گرفته است',
      bottomEnd: 'این استپ در پایین صفحه و در آخر صفحه قرار گرفته است',
      bottomCenter: 'این استپ در پایین صفحه و در وسط اون قرار گرفته است',
      bottomStart: 'این استپ در پایین صفحه و در شروع صفحه قرار گرفته است',
      emoji:
        'در این استپ یه ایموجی رو میبینیم. ایموجی گرفته شده از کامپوننت ایموجی هست که اون رو در اینجا قرار میدهیم برای جذاب تر شدن استپ و ترغیب به خوندن اون',
      icon: 'اگر لازم باشد میتوانیم از متریال آیکن ها هم بجای ایموجی ها استفاده کنیم. به این صورت که گاهی اون ها رو در اینجا قرار میدیم تا استپ جذاب تری داشته باشیم',
      noneClosable:
        'این استپ به هیچ عنوان قابل بسته شدن نیست. یعنی وقتی روی این استپ هستیم دیگه نمیتونیم تور رو ببندیم',
      loading: 'در این استپ یه حالت لودینگ رو داریم. در این حالت استپ هم قابل بسته شدن نیست',
      onReach:
        'وقتی به این استپ رسیدیم یه کالبک فانکشن اجرا شد. از این ویژگی میتونیم برای کارهایی مثل ترکینگ کاربرها از طریق ابزارهایی مثل گوگل انالیتیکس  استفاده کنیم',
      onClose:
        'اگر روی این استپ تور رو ببندیم یه کالبک فانکشن اجرا میشه. هدف از این ویژگی هم استفاده برای ترکینگ کاربرها است',
      refPositionStart: 'وقتی به این استپ رسیدیم، رفرنس در بالای صفحه قرار گرفت',
      refPositionCenter:
        'وقتی به این استپ رسیدیم، رفرنس در وسط صفحه قرار گرفت که این حالت پیشفرض هم هست',
      refPositionEnd: 'وقتی به این استپ رسیدیم، رفرنس در پایین صفحه قرار گرفت',
    },
  },

  infiniteScrollView: {
    endMessage: 'به انتهای لیست رسیدی :)',
    loadingMessage: 'در حال بارگذاری دیتای بیشتر...',
  },
}
